wjw890912/si4432-m051/M051_SI4432_RELAY/Lib/DrvSPI.c
    if(eSpiPort == eDRVSPI_PORT0)
    {
        NVIC_SetPriority(SPI0_IRQn, (1<<__NVIC_PRIO_BITS) - 2);
        NVIC_EnableIRQ(SPI0_IRQn);
    }
    else
    {
        NVIC_SetPriority(SPI1_IRQn, (1<<__NVIC_PRIO_BITS) - 2);
        NVIC_EnableIRQ(SPI1_IRQn);
    }
}   

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_DisableInt                                                                             */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*    eSpiPort   [in]: Specify the SPI port                                                                */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    None.                                                                                                */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Disable the SPI interrupt.                                                                           */
/*---------------------------------------------------------------------------------------------------------*/
void DrvSPI_DisableInt(E_DRVSPI_PORT eSpiPort)
{
    g_sSpiHandler[eSpiPort].pfncallback = NULL;
    g_sSpiHandler[eSpiPort].u32userData = 0;
    
    SPI_PORT[eSpiPort]->CNTRL.IE = 0;

    if(eSpiPort == eDRVSPI_PORT0)
    {
        NVIC_DisableIRQ(SPI0_IRQn);
    }
    else
    {
        NVIC_DisableIRQ(SPI1_IRQn);
    }
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_GetIntFlag                                                                             */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*    eSpiPort   [in]: Specify the SPI port                                                                */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    0: SPI interrupt doesn't occur                                                                       */
/*    1: SPI interrupt occurs                                                                              */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Return the SPI interrupt flag                                                                        */
/*---------------------------------------------------------------------------------------------------------*/
uint32_t DrvSPI_GetIntFlag(E_DRVSPI_PORT eSpiPort)
{
    return (SPI_PORT[eSpiPort]->CNTRL.IF);
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_ClrIntFlag                                                                             */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*    eSpiPort   [in]: Specify the SPI port                                                                */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    None                                                                                                 */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Clear the SPI interrupt flag                                                                         */
/*---------------------------------------------------------------------------------------------------------*/
void DrvSPI_ClrIntFlag(E_DRVSPI_PORT eSpiPort)
{
    SPI_PORT[eSpiPort]->CNTRL.IF = 1;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_SingleRead                                                                             */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*    eSpiPort   [in]:  Specify the SPI port                                                               */
/*    pu32Data   [out]: Store the data got from the SPI bus.                                               */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    TRUE:  The data stored in pu32Data is valid.                                                         */
/*    FALSE: The data stored in pu32Data is invalid.                                                       */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Read data from SPI Rx registers and trigger SPI for next transfer.                                   */
/*---------------------------------------------------------------------------------------------------------*/
uint8_t DrvSPI_SingleRead(E_DRVSPI_PORT eSpiPort, uint32_t *pu32Data)
{
    if(SPI_PORT[eSpiPort]->CNTRL.GO_BUSY==1)
        return FALSE;

    *pu32Data = SPI_PORT[eSpiPort]->RX[0];
    SPI_PORT[eSpiPort]->CNTRL.GO_BUSY = 1;
    return TRUE;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_SingleWrite                                                                            */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*    eSpiPort  [in]:  Specify the SPI port                                                                */
/*    pu32Data  [in]:  Store the data which will be transmitted through the SPI bus.                       */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    TRUE:  The data stored in pu32Data has been transferred.                                             */
/*    FALSE: The SPI is in busy. The data stored in pu32Data has not been transferred.                     */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Write data to SPI bus and trigger SPI to start transfer.                                             */
/*---------------------------------------------------------------------------------------------------------*/
uint8_t DrvSPI_SingleWrite(E_DRVSPI_PORT eSpiPort, uint32_t *pu32Data)
{
    if(SPI_PORT[eSpiPort]->CNTRL.GO_BUSY==1)
        return FALSE;

    SPI_PORT[eSpiPort]->TX[0] = *pu32Data;
    SPI_PORT[eSpiPort]->CNTRL.GO_BUSY = 1;
    return TRUE;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_BurstRead                                                                              */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*    eSpiPort  [in]:  Specify the SPI port                                                                */
/*    pu32Buf   [out]: Store the data got from the SPI bus.                                                */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    TRUE:  The data stored in pu32Buf is valid.                                                          */
/*    FALSE: The data stored in pu32Buf is invalid.                                                        */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Read two words of data from SPI Rx registers and then trigger SPI for next transfer.                 */
/*---------------------------------------------------------------------------------------------------------*/
uint8_t DrvSPI_BurstRead(E_DRVSPI_PORT eSpiPort, uint32_t *pu32Buf)
{
    if(SPI_PORT[eSpiPort]->CNTRL.GO_BUSY==1)
        return FALSE;

