wjw890912/si4432-m051/M051_SI4432_RELAY/Lib/DrvSPI.c
    pu32Buf[0] = SPI_PORT[eSpiPort]->RX[0];
    pu32Buf[1] = SPI_PORT[eSpiPort]->RX[1];
    SPI_PORT[eSpiPort]->CNTRL.GO_BUSY = 1;

    return TRUE;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_BurstWrite                                                                             */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*    eSpiPort  [in]:  Specify the SPI port                                                                */
/*    pu32Buf   [in]:  Store the data which will be transmitted through the SPI bus.                       */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    TRUE:  The data stored in pu32Buf has been transferred.                                              */
/*    FALSE: The SPI is in busy. The data stored in pu32Buf has not been transferred.                      */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Write two words of data to SPI bus and then trigger SPI to start transfer.                           */
/*---------------------------------------------------------------------------------------------------------*/
uint8_t DrvSPI_BurstWrite(E_DRVSPI_PORT eSpiPort, uint32_t *pu32Buf)
{
    if(SPI_PORT[eSpiPort]->CNTRL.GO_BUSY==1)
        return FALSE;

    SPI_PORT[eSpiPort]->TX[0] = pu32Buf[0];
    SPI_PORT[eSpiPort]->TX[1] = pu32Buf[1];
    SPI_PORT[eSpiPort]->CNTRL.GO_BUSY = 1;

    return TRUE;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_DumpRxRegister                                                                         */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*    eSpiPort     [in]:  Specify the SPI port                                                             */
/*    pu32Buf      [out]: Store the data got from Rx registers.                                            */
/*    u32DataCount [in]:  The count of data read from Rx registers.                                        */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    The count of data actually read from Rx registers.                                                   */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Read data from Rx registers. This function will not trigger a SPI data transfer.                     */
/*---------------------------------------------------------------------------------------------------------*/
uint32_t DrvSPI_DumpRxRegister(E_DRVSPI_PORT eSpiPort, uint32_t *pu32Buf, uint32_t u32DataCount)
{
    uint32_t i;
    
    if(u32DataCount>2)
        u32DataCount = 2;
    
    for(i=0; i<u32DataCount; i++)
    {
        pu32Buf[i] = SPI_PORT[eSpiPort]->RX[i];
    }

    return u32DataCount;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_SetTxRegister                                                                          */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*    eSpiPort     [in]:  Specify the SPI port                                                             */
/*    pu32Buf      [in]:  Store the data which will be written to Tx registers.                            */
/*    u32DataCount [in]:  The count of data write to Tx registers.                                         */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    The count of data actually written to Tx registers.                                                  */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Write data to Tx registers. This function will not trigger a SPI data transfer.                      */
/*---------------------------------------------------------------------------------------------------------*/
uint32_t DrvSPI_SetTxRegister(E_DRVSPI_PORT eSpiPort, uint32_t *pu32Buf, uint32_t u32DataCount)
{
    uint32_t i;

    if(u32DataCount>2)
        u32DataCount = 2;
    
    for(i=0; i<u32DataCount; i++)
    {
        SPI_PORT[eSpiPort]->TX[i] = pu32Buf[i];
    }

    return u32DataCount;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_SetGo                                                                                  */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*    eSpiPort     [in]:  Specify the SPI port                                                             */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    None.                                                                                                */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Set the GO_BUSY bit to trigger a SPI data trasfer.                                                   */
/*---------------------------------------------------------------------------------------------------------*/
void DrvSPI_SetGo(E_DRVSPI_PORT eSpiPort)
{
    SPI_PORT[eSpiPort]->CNTRL.GO_BUSY = 1;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_ClrGo                                                                                  */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*    eSpiPort     [in]:  Specify the SPI port                                                             */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    None.                                                                                                */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Clear the GO_BUSY bit.                                                                               */
/*---------------------------------------------------------------------------------------------------------*/
void DrvSPI_ClrGo(E_DRVSPI_PORT eSpiPort)
{
    SPI_PORT[eSpiPort]->CNTRL.GO_BUSY = 0;
}

/*---------------------------------------------------------------------------------------------------------*/
/* Function: DrvSPI_GetVersion                                                                             */
/*                                                                                                         */
/* Parameters:                                                                                             */
/*    None.                                                                                                */
/*                                                                                                         */
/* Returns:                                                                                                */
/*    Version number.                                                                                      */
/*                                                                                                         */
/* Description:                                                                                            */
/*    Get the version number of NUC100 SPI driver.                                                         */
/*---------------------------------------------------------------------------------------------------------*/
uint32_t DrvSPI_GetVersion(void)
{
    return DRVSPI_VERSION_NUM;
}
